![Image ](https://i.imgur.com/SsfgzAq.png)

# 6. Integrity Checks </h2> </a>
___

For a full demo you can visit the following custom website: http://mayosql.me/
<br> created by: Faris Alenzy

In [1]:
import sqlite3
import pandas as pd
from sqlalchemy import create_engine
from IPython.display import display, Markdown, Latex

engine = create_engine("sqlite:///CourseData.db")

In [2]:
#%load_ext sql
%reload_ext sql

# initialize a database connection
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

## 6.1 Domain Integrity

In [145]:
import pandas as pd
from sqlalchemy import create_engine

dbtable = ['PROGRAMS','FACULTY' , 'LOCATION' , 'COURSE' ,
            'CLASS_MEETINGS', 'CATALOG_YEAR' ,'COURSE_OFFERING']

for i in dbtable:
    query = "PRAGMA TABLE_INFO ({}) ".format (i)

    table_info = pd.read_sql_query(query,engine)
    table_info = table_info.rename(columns={"name": "ColumnName" ,"type": "DataType" , 'dflt_value':'default_value',"pk": 'primary_key'})
    table_info.primary_key = table_info.primary_key.map({1:"Yes" , 0: ""})
    display(Markdown('**Table : {}**'.format(i)))
    blankIndex=[''] * len(table_info)
    table_info.index=blankIndex
    display(table_info)

**Table : PROGRAMS**

  cid    ColumnName DataType  notnull default_value primary_key
    0           PID  INTEGER        0          None         Yes
    1  program_code     TEXT        1          None
    2  program_name     TEXT        1          None

**Table : FACULTY**

  cid        ColumnName DataType  notnull default_value primary_key
    0               FID  INTEGER        0          None         Yes
    1  instructor_fname     TEXT        1          None
    2  instructor_lname     TEXT        1          None

**Table : LOCATION**

  cid    ColumnName DataType  notnull default_value primary_key
    0           LID  INTEGER        0          None         Yes
    1  BuildingName     TEXT        0          None
    2  BuildingCode     TEXT        0          None
    3      location     TEXT        0          None

**Table : COURSE**

  cid    ColumnName DataType  notnull default_value primary_key
    0           CID  INTEGER        0          None         Yes
    1           PID  INTEGER        1          None
    2   CatalogYear     TEXT        1          None
    3    catalog_ID     TEXT        1          None
    4  course_title     TEXT        1          None
    5       credits     TEXT        1          None
    6       prereqs     TEXT        0          None
    7        coreqs     TEXT        0          None
    8          fees     TEXT        0          None
    9    attributes     TEXT        0          None
   10   description     TEXT        0          None

**Table : CLASS_MEETINGS**

  cid ColumnName DataType  notnull default_value primary_key
    0       CMID  INTEGER        0          None         Yes
    1       COID  INTEGER        0          None
    2        LID  INTEGER        0          None
    3        DAY     TEXT        0          None
    4      START     TEXT        0          None
    5        END     TEXT        0          None
    6        CRN     TEXT        0          None
    7   SEMESTER     TEXT        1          None
    8       YEAR  INTEGER        1          None

**Table : CATALOG_YEAR**

  cid   ColumnName  DataType  notnull default_value primary_key
    0  CatalogYear      TEXT        0          None
    1         YEAR  INTERGER        0          None
    2     SEMESTER      TEXT        0          None

**Table : COURSE_OFFERING**

  cid        ColumnName DataType  notnull default_value primary_key
    0              COID  INTEGER        0          None         Yes
    1               CID  INTEGER        0          None
    2               FID  INTEGER        1          None
    3               CRN     TEXT        1          None
    4          SEMESTER     TEXT        1          None
    5              YEAR  INTEGER        1          None
    6             TITLE     TEXT        1          None
    7        CATALOG_ID     TEXT        0          None
    8       CatalogYear     TEXT        0          None
    9          MEETINGS     TEXT        0          None
   10         TIMECODES     TEXT        0          None
   11           SECTION     TEXT        1          None
   12               CAP  INTEGER        1          None
   13               ACT  INTEGER        1          None
   14               REM  INTEGER        1          None
   15  instructor_lname     TEXT        0          None
   16  instructor_fname     TEXT        0          None

## 6.2 Entity Integrity

In [4]:
%%sql
-- There should be 4440 Catalog Entries, 15937 Course Offerings, and 284847 Course Meetings
SELECT 
    (SELECT Count(*) FROM COURSE) as CatalogCourses,
    (SELECT Count(*) FROM COURSE_OFFERING) as CourseOfferings,
    (SELECT Count(*) FROM CLASS_MEETINGS) as CourseMeetings;

 * sqlite:///CourseData.db
Done.

[(6696, 15937, 284847)]

_Check that each row of a table has a unique and non-null primary key value_

In [31]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine("sqlite:///CourseData.db")
dbtable = ['PROGRAMS','FACULTY' , 'LOCATION' , 'COURSE' ,
            'CLASS_MEETINGS', 'CATALOG_YEAR' ,'COURSE_OFFERING']
for i in range(len(dbtable)) :
    display(Markdown('**Table : {}**'.format( dbtable[i])))
    tables = pd.read_sql_table(dbtable[i],engine)
    blankIndex=[''] * len(tables)
    tables.index=blankIndex
    display(tables.head())
    display(Markdown(" "))
    display(Markdown(" "))
    display(Markdown("**Missing If Any :**"))
    tables_na = tables.isna().sum().to_frame("NumberOfMisiing")
    #display(Markdown(i.tables_na["NumberOfMisiing"]))
    for index, row in tables_na.iterrows():
        display(Markdown("+ {0} Number of Missing: {1}".format(index,row["NumberOfMisiing"])))
     
        display(Markdown(" "))
    display(Markdown(" The Number of Rows: {0} <br> The Number of Columns: {1}".format(tables.shape[0] , tables.shape[1])))
    display(Markdown("---"))

**Table : PROGRAMS**

  PID program_code    program_name
    1           AN   Asian Studies
    2           BU        Business
    3           BL   Black Studies
    4          BEN  Bioengineering
    5           AR          Arabic

**Missing If Any :**

+ PID Number of Missing: 0

+ program_code Number of Missing: 0

+ program_name Number of Missing: 0

 The Number of Rows: 92 <br> The Number of Columns: 3

---

**Table : FACULTY**

  FID instructor_fname instructor_lname
    1       Michael P.            Coyne
    2       Rebecca I.            Bloch
    3             Paul           Caster
    4           Jo Ann        Drusbosky
    5        Arleen N.           Kardos

**Missing If Any :**

+ FID Number of Missing: 0

+ instructor_fname Number of Missing: 0

+ instructor_lname Number of Missing: 0

 The Number of Rows: 1104 <br> The Number of Columns: 3

---

**Table : LOCATION**

  LID              BuildingName BuildingCode  location
    1  Dolan School of Business          DSB   DSB 105
    2  Dolan School of Business          DSB   DSB 111
    3  Dolan School of Business          DSB  DSB 110A
    4  Dolan School of Business          DSB   DSB 108
    5  Dolan School of Business          DSB  DSB 110B

**Missing If Any :**

+ LID Number of Missing: 0

+ BuildingName Number of Missing: 0

+ BuildingCode Number of Missing: 0

+ location Number of Missing: 0

 The Number of Rows: 207 <br> The Number of Columns: 4

---

**Table : COURSE**

,CID,PID,CatalogYear,catalog_ID,course_title,credits,prereqs,coreqs,fees,attributes,description
,1,1,2017_2018,AN 0301,Independent Study,1-3 Credits,None,None,None,None,Students undertake an individualized program o...
,2,1,2017_2018,AN 0310,Asian Studies Seminar,3 Credits,None,None,None,None,This seminar examines selected topics concerni...
,3,2,2017_2018,BU 0211,Legal Environment of Business,3 Credits,Junior standing.,None,None,None,This course examines the broad philosophical a...
,4,2,2017_2018,BU 0220,Environmental Law and Policy,3 Credits,None,None,None,"EVME Environmental Studies Major Elective, EVP...",This course surveys issues arising out of fede...
,5,2,2017_2018,BU 0311,"The Law of Contracts, Sales, and Property",3 Credits,BU 0211.,None,None,None,This course examines the components of common ...

**Missing If Any :**

+ CID Number of Missing: 0

+ PID Number of Missing: 0

+ CatalogYear Number of Missing: 0

+ catalog_ID Number of Missing: 0

+ course_title Number of Missing: 0

+ credits Number of Missing: 0

+ prereqs Number of Missing: 3306

+ coreqs Number of Missing: 6354

+ fees Number of Missing: 6306

+ attributes Number of Missing: 4452

+ description Number of Missing: 259

 The Number of Rows: 6696 <br> The Number of Columns: 11

---

**Table : CLASS_MEETINGS**

,CMID,COID,LID,DAY,START,END,CRN,SEMESTER,YEAR
,1,1,1,T,2014-09-02T08:00:00,2014-09-02T09:15:00,70384,Fall,2014
,2,1,1,F,2014-09-05T08:00:00,2014-09-05T09:15:00,70384,Fall,2014
,3,1,1,T,2014-09-09T08:00:00,2014-09-09T09:15:00,70384,Fall,2014
,4,1,1,F,2014-09-12T08:00:00,2014-09-12T09:15:00,70384,Fall,2014
,5,1,1,T,2014-09-16T08:00:00,2014-09-16T09:15:00,70384,Fall,2014

**Missing If Any :**

+ CMID Number of Missing: 0

+ COID Number of Missing: 0

+ LID Number of Missing: 0

+ DAY Number of Missing: 0

+ START Number of Missing: 0

+ END Number of Missing: 0

+ CRN Number of Missing: 0

+ SEMESTER Number of Missing: 0

+ YEAR Number of Missing: 0

 The Number of Rows: 284847 <br> The Number of Columns: 9

---

**Table : CATALOG_YEAR**

 CatalogYear  YEAR SEMESTER
   2014_2015  2014     Fall
   2014_2015  2015   Winter
   2014_2015  2015   Spring
   2014_2015  2015   Summer
   2015_2016  2015     Fall

**Missing If Any :**

+ CatalogYear Number of Missing: 0

+ YEAR Number of Missing: 0

+ SEMESTER Number of Missing: 0

 The Number of Rows: 20 <br> The Number of Columns: 3

---

**Table : COURSE_OFFERING**

,COID,CID,FID,CRN,SEMESTER,YEAR,TITLE,CATALOG_ID,CatalogYear,MEETINGS,TIMECODES,SECTION,CAP,ACT,REM,instructor_lname,instructor_fname
,1,NaN,1,70384,Fall,2014,Introduction to Financial Accounting,AC 0011,2014_2015,"[{'days': 'TF', 'times': '0800am-0915am', 'dat...",['TF 0800am-0915am 09/02-12/08 DSB 105'],C01,0,31,-31,Coyne,Michael P.
,2,NaN,1,70385,Fall,2014,Introduction to Financial Accounting,AC 0011,2014_2015,"[{'days': 'TF', 'times': '0930am-1045am', 'dat...",['TF 0930am-1045am 09/02-12/08 DSB 105'],C02,0,31,-31,Coyne,Michael P.
,3,NaN,1,70382,Fall,2014,Introduction to Financial Accounting,AC 0011,2014_2015,"[{'days': 'TF', 'times': '1230pm-0145pm', 'dat...",['TF 1230pm-0145pm 09/02-12/08 DSB 105'],C03,0,31,-31,Coyne,Michael P.
,4,NaN,2,70291,Fall,2014,Introduction to Financial Accounting,AC 0011,2014_2015,"[{'days': 'MR', 'times': '1100am-1215pm', 'dat...",['MR 1100am-1215pm 09/02-12/08 DSB 111'],C04,0,29,-29,Bloch,Rebecca I.
,5,NaN,2,70350,Fall,2014,Introduction to Financial Accounting,AC 0011,2014_2015,"[{'days': 'MR', 'times': '1230pm-0145pm', 'dat...",['MR 1230pm-0145pm 09/02-12/08 DSB 111'],C05,0,30,-30,Bloch,Rebecca I.

**Missing If Any :**

+ COID Number of Missing: 0

+ CID Number of Missing: 4474

+ FID Number of Missing: 0

+ CRN Number of Missing: 0

+ SEMESTER Number of Missing: 0

+ YEAR Number of Missing: 0

+ TITLE Number of Missing: 0

+ CATALOG_ID Number of Missing: 0

+ CatalogYear Number of Missing: 0

+ MEETINGS Number of Missing: 0

+ TIMECODES Number of Missing: 0

+ SECTION Number of Missing: 0

+ CAP Number of Missing: 0

+ ACT Number of Missing: 0

+ REM Number of Missing: 0

+ instructor_lname Number of Missing: 0

+ instructor_fname Number of Missing: 0

 The Number of Rows: 15937 <br> The Number of Columns: 17

---

## 6.3 Relational Integrity

In [21]:
#%load_ext sql
%reload_ext sql

# initialize a database connection
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

In [22]:
%%sql
SELECT COUNT(*) FROM LOCATION;

 * sqlite:///CourseData.db
Done.

[(207,)]

- Check if there is a catalog_ID starting with 'BA', to find Business Analytics courses

In [23]:
%%sql
SELECT PID, Catalog_ID FROM COURSE
where Catalog_ID like "BA%"
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(92, 'BA 0500'),
 (92, 'BA 0505'),
 (92, 'BA 0510'),
 (92, 'BA 0540'),
 (92, 'BA 0545')]

- Check the first 10 rows from the table: 'PROGRAMS'

In [24]:
%%sql
SELECT * FROM PROGRAMS
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'AN', 'Asian Studies'),
 (2, 'BU', 'Business'),
 (3, 'BL', 'Black Studies'),
 (4, 'BEN', 'Bioengineering'),
 (5, 'AR', 'Arabic'),
 (6, 'AY', 'Anthropology'),
 (7, 'AS', 'American Studies'),
 (8, 'JA', 'Japanese'),
 (9, 'AH', 'Art History'),
 (10, 'AE', 'Applied Ethics')]

- Show first 20 courses taught by instructor 'Tao' (ordered ascending by year and semester)

In [25]:
%%sql
SELECT FACULTY.instructor_fname,FACULTY.instructor_lname,Title,Catalog_id,Section,Semester,Year
FROM FACULTY
    JOIN COURSE_OFFERING USING(FID)
WHERE FACULTY.instructor_lname like '%Tao'
ORDER BY Year, Semester
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Jie', ' Tao', 'Intro to Information Systems', 'IS 0100', 'C', 'Fall', 2015),
 ('Jie', ' Tao', 'Intro to Information Systems', 'IS 0100', 'D', 'Fall', 2015),
 ('Jie', ' Tao', 'Systems Analysis and Logical Design', 'IS 0240', 'A', 'Fall', 2015),
 ('Jie', ' Tao', 'Information Systems and Database Management', 'IS 0500', '01', 'Summer', 2015),
 ('Jie', ' Tao', 'Introduction to Information Systems', 'IS 0100', '03', 'Fall', 2016),
 ('Jie', ' Tao', 'Introduction to Information Systems', 'IS 0100', '04', 'Fall', 2016),
 ('Jie', ' Tao', 'Data Mining and Applications', 'IS 0315', '01', 'Fall', 2016),
 ('Jie', ' Tao', 'Information Systems and Database Management', 'IS 0500', '01', 'Fall', 2016),
 ('Jie', ' Tao', 'Independent Study in Information Systems and Operations Management', 'IS 0598', 'JT', 'Fall', 2016),
 ('Jie', ' Tao', 'Intro to Information Systems', 'IS 0100', 'D', 'Spring', 2016),
 ('Jie', ' Tao', 'Data Mining and Business Intelligence', 'IS 0540', '01', 'Spring', 2016),
 ('Jie', ' Tao', 'Business Analytics and Big Data Mgmt', 'IS 0550', '01', 'Spring', 2016),
 ('Jie', ' Tao', 'Contemporary Topics: Advanced Data Mining Applications', 'IS 0585B', '01', 'Summer', 2016),
 ('Jie', ' Tao', 'Independent Study', 'IS 0399', 'JT', 'Spring', 2017),
 ('Jie', ' Tao', 'Information Systems and Database Management', 'IS 0500', '01', 'Spring', 2017),
 ('Jie', ' Tao', 'Data Mining and Business Intelligence', 'IS 0540', '01', 'Spring', 2017),
 ('Jie', ' Tao', 'Business Analytics and Big Data Mgmt', 'IS 0550', '01', 'Spring', 2017),
 ('Jie', ' Tao', 'Independent Study in Information Systems and Operations Management', 'IS 0598', 'JT', 'Spring', 2017),
 ('Jie', ' Tao', 'Introduction to Information Systems', 'IS 0100', '02', 'Fall', 2018),
 ('Jie', ' Tao', 'Introduction to Information Systems', 'IS 0100', '04', 'Fall', 2018)]

In [19]:
display(Markdown("---"))
display(Markdown('### <p style="text-align: center;"><span style="background-color: #333333; color: #ffffff;">Instructor Lookup</span></p>'))
#display(Markdown("---"))

input_instructor = display(Markdown("**Enter the instructor's last name**"))
input_instructor = input()
input_year =display(Markdown("**Enter the year you wish to see or type in No to see all the years:**"))
input_year = input().lower()
try:
    if input_year == "no" or  input_year == "n" or  input_year == "nah" :
    
        query = '''SELECT FACULTY.instructor_fname,FACULTY.instructor_lname,Title,Catalog_id,Section,Semester,Year
        FROM FACULTY
            JOIN COURSE_OFFERING USING(FID)
        WHERE FACULTY.instructor_lname like '%{}'
        ORDER BY Year, Semester
        LIMIT 20'''.format(input_instructor)
        tables = pd.read_sql_query(query,engine)
        display(tables  )

    else :
        input_semester = display(Markdown("**Enter the semester you wish to see or type in No to see all the courses that the instructor is teaching in {0} :**".format(input_year)))
        input_semester = input().lower()

        if input_semester == "no" or  input_semester == "n" or  input_semester == "nah" :
            query = '''SELECT FACULTY.instructor_fname,FACULTY.instructor_lname,Title,Catalog_id,Section,Semester,Year
        FROM FACULTY
        JOIN COURSE_OFFERING USING(FID)
        WHERE FACULTY.instructor_lname like '%{0}' and year = {1}
        ORDER BY Year, Semester
        LIMIT 20'''.format(input_instructor , input_year )
            tables = pd.read_sql_query(query,engine)
            display(tables  )
        else:
            query = '''SELECT FACULTY.instructor_fname,FACULTY.instructor_lname,Title,Catalog_id,Section,Semester,Year
        FROM FACULTY
        JOIN COURSE_OFFERING USING(FID)
        WHERE FACULTY.instructor_lname like '%{0}' 
        AND year = {1}
        AND SEMESTER == '{2}'
        ORDER BY Year, Semester
        LIMIT 20'''.format(input_instructor ,
                           input_year , 
                           input_semester.capitalize() )
            tables = pd.read_sql_query(query,engine)
            display(tables  )
except:
    display(Markdown("**You have entered a wrong value**"))

---

### <p style="text-align: center;"><span style="background-color: #333333; color: #ffffff;">Instructor Lookup</span></p>

**Enter the instructor's last name**

 tao

**Enter the year you wish to see or type in No to see all the years:**

 2018

**Enter the semester you wish to see or type in No to see all the courses that the instructor is teaching in 2018 :**

 fall

,instructor_fname,instructor_lname,TITLE,CATALOG_ID,SECTION,SEMESTER,YEAR
0,Jie,Tao,Introduction to Information Systems,IS 0100,02,Fall,2018
1,Jie,Tao,Introduction to Information Systems,IS 0100,04,Fall,2018
2,Jie,Tao,Introduction to Information Systems,IS 0100,05,Fall,2018
3,Jie,Tao,Business Analytics and Big Data Management,IS 0550,JT,Fall,2018

In [26]:
%%sql
SELECT COID, CMID, START, CLASS_MEETINGS.year, CLASS_MEETINGS.SEMESTER , CLASS_MEETINGS.CRN
FROM COURSE_OFFERING
    JOIN CLASS_MEETINGS USING (COID)
where CLASS_MEETINGS.YEAR = 2019 and CLASS_MEETINGS.SEMESTER == "Spring" and CLASS_MEETINGS.CRN = 39006
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(13345, 3140, '2019-01-29T18:30:00', 2019, 'Spring', '39006'),
 (13345, 3141, '2019-02-05T18:30:00', 2019, 'Spring', '39006'),
 (13345, 3142, '2019-02-12T18:30:00', 2019, 'Spring', '39006'),
 (13345, 3143, '2019-02-26T18:30:00', 2019, 'Spring', '39006'),
 (13345, 3144, '2019-03-05T18:30:00', 2019, 'Spring', '39006'),
 (13345, 3145, '2019-03-12T18:30:00', 2019, 'Spring', '39006'),
 (13345, 30636, '2019-02-02T09:00:00', 2019, 'Spring', '39006'),
 (13345, 30637, '2019-02-16T09:00:00', 2019, 'Spring', '39006'),
 (13345, 30638, '2019-03-09T09:00:00', 2019, 'Spring', '39006')]

- <b> Check if course offering ID (COID) is unique </b> (has a count of 1)
<br> For example in 2019, for the 'Spring' Semester for course registration number (CRN): '39006'

In [27]:
%%sql
SELECT CLASS_MEETINGS.YEAR ,CLASS_MEETINGS.SEMESTER,COUNT(COID) 
FROM COURSE_OFFERING JOIN CLASS_MEETINGS USING (COID)
where CLASS_MEETINGS.YEAR = 2019 and CLASS_MEETINGS.SEMESTER == "Spring" and CLASS_MEETINGS.CRN = 39006
GROUP BY CMID

 * sqlite:///CourseData.db
Done.

[(2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1),
 (2019, 'Spring', 1)]

In [28]:
%%sql
SELECT catalog_ID,program_code,program_name
FROM COURSE
    JOIN PROGRAMS USING (PID)
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'AN', 'Asian Studies'),
 ('AN 0310', 'AN', 'Asian Studies'),
 ('BU 0211', 'BU', 'Business'),
 ('BU 0220', 'BU', 'Business'),
 ('BU 0311', 'BU', 'Business')]

In [29]:
%%sql
SELECT CLASS_MEETINGS.CRN,Day,Start,End,Catalog_id,Section,Meetings ,BuildingName ,Location as Room
FROM CLASS_MEETINGS
    JOIN COURSE_OFFERING USING (COID)
    JOIN LOCATION USING (LID)
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('70384', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00', 'AC 0011', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Dolan School of Business', 'DSB 105'),
 ('70384', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00', 'AC 0011', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Dolan School of Business', 'DSB 105'),
 ('70384', 'T', '2014-09-09T08:00:00', '2014-09-09T09:15:00', 'AC 0011', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Dolan School of Business', 'DSB 105'),
 ('70384', 'F', '2014-09-12T08:00:00', '2014-09-12T09:15:00', 'AC 0011', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Dolan School of Business', 'DSB 105'),
 ('70384', 'T', '2014-09-16T08:00:00', '2014-09-16T09:15:00', 'AC 0011', 'C01', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", 'Dolan School of Business', 'DSB 105')]

In [27]:
engine = create_engine("sqlite:///CourseData.db")

#pick a table to load into a df
table = 'PROGRAMS'
#load the table into a df  and give a condition( where, join)
query = '''SELECT * FROM {} LIMIT 5'''.format(table)
tables = pd.read_sql_query(query,engine)
print("------------------------------------------------------------")
print("------------------------------------------------------------")
print("              tables shape :",tables.shape)
print("------------------------------------------------------------")
print("------------------------------------------------------------")
display(tables.head(2))
#load the whole table into a df
tables_all = pd.read_sql_table (table ,engine)
print("------------------------------------------------------------")
print("------------------------------------------------------------")
print("               tables_all shape: ",tables_all.shape)
print("------------------------------------------------------------")
print("------------------------------------------------------------")
tables_all.head(2)

------------------------------------------------------------
------------------------------------------------------------
              tables shape : (5, 3)
------------------------------------------------------------
------------------------------------------------------------

   PID program_code   program_name
0  1    AN           Asian Studies
1  2    BU           Business

------------------------------------------------------------
------------------------------------------------------------
               tables_all shape:  (83, 3)
------------------------------------------------------------
------------------------------------------------------------

   PID program_code   program_name
0  1    AN           Asian Studies
1  2    BU           Business

- <b> Show the Tables with corresponding columns, datatypes, constraints and primary key

In [28]:
# show non-truncated long strings in pandas columns
pd.set_option('display.max_colwidth', -1)

#checking the db tables after dropping the import tables.
query = 'SELECT * from sqlite_master where type= "table"'
engine = create_engine("sqlite:///CourseData.db")

tables = pd.read_sql_query(query,engine)
tables = tables.rename(columns={"name": "DatabaseTables"})
tables

,type,DatabaseTables,tbl_name,rootpage,sql
0,table,PROGRAMS,PROGRAMS,2,"CREATE TABLE PROGRAMS ( \n [PID] INTEGER PRIMARY KEY,\n [program_code] TEXT NOT NULL,\n [program_name] TEXT NOT NULL)"
1,table,FACULTY,FACULTY,3,"CREATE TABLE FACULTY ( \n [FID] INTEGER PRIMARY KEY,\n [instructor_fname] TEXT NOT NULL,\n [instructor_lname] TEXT NOT NULL)"
2,table,LOCATION,LOCATION,4,"CREATE TABLE LOCATION ( \n [LID] INTEGER PRIMARY KEY,\n [BuildingName] TEXT,\n [BuildingCode] TEXT,\n [location] TEXT)"
3,table,COURSE,COURSE,5,"CREATE TABLE COURSE ( \n [CID] INTEGER PRIMARY KEY,\n [PID] INTEGER NOT NULL,\n [CatalogYear] TEXT NOT NULL,\n [catalog_ID] TEXT NOT NULL,\n [course_title] TEXT NOT NULL,\n [credits] TEXT NOT NULL,\n [prereqs] TEXT,\n [coreqs] TEXT,\n [fees] text,\n [attributes] TEXT,\n [description] TEXT,\n FOREIGN KEY (PID) REFERENCES PROGRAMS (PID)\n)"
4,table,COURSE_OFFERING,COURSE_OFFERING,6,"CREATE TABLE COURSE_OFFERING ( \n [COID] INTEGER PRIMARY KEY,\n [CID] INTEGER,\n [FID] INTEGER NOT NULL,\n [CRN] TEXT NOT NULL,\n [SEMESTER] TEXT NOT NULL,\n [YEAR] INTEGER NOT NULL,\n [TITLE] TEXT NOT NULL,\n [CATALOG_ID] TEXT,\n [CatalogYear] TEXT,\n [MEETINGS] TEXT,\n [TIMECODES] TEXT,\n [SECTION] TEXT NOT NULL,\n [CAP] INTEGER NOT NULL,\n [ACT] INTEGER NOT NULL,\n [REM] INTEGER NOT NULL,\n [instructor_lname] TEXT,\n [instructor_fname] TEXT,\n FOREIGN KEY (CID) REFERENCES COURSE (CID)\n FOREIGN KEY (FID) REFERENCES FACULTY (FID)\n)"
5,table,CLASS_MEETINGS,CLASS_MEETINGS,7,"CREATE TABLE CLASS_MEETINGS ( \n [CMID] INTEGER PRIMARY KEY,\n [COID] INTEGER,\n [LID] INTEGER,\n [DAY] TEXT,\n [START] TEXT,\n [END] TEXT,\n [CRN] TEXT,\n [SEMESTER] TEXT NOT NULL,\n [YEAR] INTEGER NOT NULL,\n FOREIGN KEY (LID) REFERENCES LOCATION (LID)\n FOREIGN KEY (COID) REFERENCES COURSE_OFFERING (COID)\n)"
6,table,CATALOG_YEAR,CATALOG_YEAR,8,"CREATE TABLE CATALOG_YEAR (\n [CatalogYear] TEXT,\n [YEAR] INTERGER ,\n [SEMESTER] TEXT\n)"

In [30]:
%%sql
-- Force SQLite to rebuild the database file to minimize file size
vacuum;

 * sqlite:///CourseData.db
Done.

[]